package org.itstep;
/*
Даны 3 целых числа. Программа выводит результат логических выражений в виде true или false:
1. Первые два числа равны между собой и не равны третьему;
2. Второе или третье число больше первого;
3. Первое не меньше второго, а второе не больше третьего;
4. Все числа разные;
5. Первое - четное, второе - нечетное, третье - отрицательное;
 */
public class Logicals {
    public static void main(String[] args) {
        //1
////        int a = 4;
//        int b = 7;
//        int c = -3;
//        if ((a == b) && (a != c)) {
//            System.out.println("True");
//       } else {
//            System.out.println("False");
//        if ((b>a) || (c>a)){
//            System.out.println("True");
//        } else {
//            System.out.println("False");
//        }
//        if ((a>=b) & (b <=c)) {
//            System.out.println("True");
//        } else{
//            System.out.println("False");
//        if (a!=b && b!=c){
//            System.out.println("True");
//        } else {
//            System.out.println("False");
//        }
//        if ((a % 2) == 0 && (b % 2) == 1 && (c < 0)) {
 //           System.out.println("a - Четное \n b - Нечетное \n с - Отрицательное");
 //       } else {
 //           System.out.println("All's wrong");
 //       }
        /*
Две клетки на шахматной доске определены своими координатами (x1,y1) и (x2,y2).
1. Может ли конь переместиться с первой на вторую клетку?
2. Может ли слон переместиться с первой на вторую клетку?
3. Может ли ладья переместиться с первой на вторую клетку?
4. Может ли король переместиться с первой на вторую клетку?
 */
        // абсолютные величины - 1. конь
        int x1 = 3;
       int y1 = 2;
       int x2 = 3;
       int y2 = 2;
//        if ((Math.abs(x1-x2) == 1 && Math.abs(y1-y2)==2) || (Math.abs(x1-x2)==2) && (Math.abs(y1-y2) == 1)) {
//            System.out.println("True");
//        } else {
//            System.out.println("False");
//        }
//        if ((Math.abs(x2-x1)) == (Math.abs(y2-y1))){
//            System.out.println("Может");
//        } else {
//            System.out.println("Никак");
//      }
//        if (x1 == x2 && y1 != y2) {
 //           System.out.println("Ходит по горизонтали");
 //       } else if (x1!=x2 && y1 == y2){
  //          System.out.println("Ходит по вертикали");
  //      } else{
 //           System.out.println("Не ходит");
  //      }
        if ((Math.abs(x2-x1)))
        x1-x2 = 1
                y1-y2 = 1 || y1 -y2 = 0


    }
}